{
  "过滤器": "Filter",
  "应用": "Apply",
  "（": "(",
  "年份": "Year",
  "：": ": ",
  "，": ", ",
  "类型": "Type",
  "标签": "Tags",
  "技术栈": "Tech Stack",
  "）": ") ",
  "开发者": "Developer",
  "双色": "Duotone",
  "图片": "Images",
  "相关链接": "Related Links",
  "项目": "Projects",
  "一个生活的容器，一个回答的回答。": "A container for life, an answer to answers.",
  "项目图片": "Project Images",
  "无法加载Markdown文件": "Unable to load Markdown file",
  "加载失败，请稍后重试": "Loading failed, please try again later",
  "项目音频": "Project Audio",
  "下一个": "Next",
  "上一个": "Previous",
  "放大": "Zoom In",
  "缩小": "Zoom Out",
  "隐藏缩略图": "Hide Thumbnails",
  "显示缩略图": "Show Thumbnails",
  "隐藏说明": "Hide Description",
  "显示说明": "Show Description",
  "全屏": "Fullscreen",
  "退出全屏": "Exit Fullscreen",
  "关闭": "Close",
  "项目图集": "Project Gallery",
  "收起": "Collapse ",
  "展开": "Expand ",
  "缩略图": "Thumbnail",
  "退出": "Exit ",
  "进入": "Enter ",
  "上一页": "Previous Page",
  "下一页": "Next Page",
  "项目视频": "Project Video",
  "清空": "Clear",
  "全选": "Select All",
  "已选择：": "Selected: ",
  "主页": "Home",
  "简介": "About",
  "作品": "Works",
  "关于": "About",
  "语言": "Language",
  "简体中文": "Simplified Chinese",
  "繁体中文": "Traditional Chinese",
  "英语（美国）": "English (US)",
  "汉语": "Chinese",
  "英语（英国）": "English (UK)",
  "日语": "Japanese",
  "没有匹配的项目": "No matching projects",
  "项目不存在": "Project does not exist",
  "前面没有啦": "No more before",
  "后面没有啦": "No more after",
  "海报": "Poster",
  "项目链接": "Project Link",
  "实际尺寸": "Actual Size",
  "适应屏幕": "Fit to Screen",
  "关于本站": "About This Site",
  "这是一次对旧的作品集网站的翻新，我尝试了新的框架——React+TS+Vite+Tailwind，代替旧作品集的Vue+Vite+JS。整个网页的构建体验感受是tailwind确实帮我节省了很多想千奇百怪的类名的时间。": "This is a renovation of an old portfolio website. I tried new frameworks—React+TS+Vite+Tailwind—in place of the old portfolio's Vue+Vite+JS. The overall web development experience was that Tailwind indeed saved me a lot of time that would have been spent coming up with various class names.",
  "其他主要用到的库和服务在Footer中已经全部列出。GSAP和Lenis对我的编程水平要求过高了，因此在性能优化方面可能并不能做到极致。项目中的大量图片、PDF文件、视频等我也找了一些新的方法托管，注册了Cloudflare用以加速。": "All other major libraries and services used are listed in the Footer. GSAP and Lenis were too demanding for my programming skills, so performance optimization may not be optimal. I also found new methods to host a large number of images, PDF files, videos, etc., and registered with Cloudflare for acceleration.",
  "无障碍和通用设计方面，tailwind非常方便地提供了断点和深色模式伪类，在编写宽度变化的响应式设计时帮助很大。国际化则沿用上个网页使用的i18next，但使用了i18next-scanner插件相当程度上提高了翻译的效率。": "In terms of accessibility and universal design, Tailwind conveniently provides breakpoints and dark mode pseudo-classes, which greatly assist in writing responsive designs with varying widths. For internationalization, I continued using i18next from the previous website but used the i18next-scanner plugin to significantly improve translation efficiency.",
  "关于开发者": "About the Developer",
  "你可以叫我布洛芬。本网站中所有文本和媒体素材权利均归属于开发者。": "You can call me Ibuprofen. All text and media materials on this site are the property of the developer.",
  "本科毕业于浙江大学园林专业。平面设计爱好者，独立游戏玩家，书影音轻度用户。": "Bachelor's degree in Landscape Architecture from Zhejiang University. Enthusiast of graphic design, independent game player, and light user of books, movies, and music.",
  "我不是专业前端开发人员，学习前端和网页交互纯粹是出于个人兴趣，因此代码优化能力有限。如果你遇到了一些卡顿问题，我大概无能为力。": "I am not a professional front-end developer. My study of front-end and web interactions is purely for personal interest, so my code optimization skills are limited. If you encounter some lag issues, I might be unable to help.",
  "情绪立方": "Emotional Cube",
  "一套为阿卡贝拉音乐会设计的宣传物料。": "A set of promotional materials designed for an a cappella concert.",
  "潮汐计划": "Project Tide",
  "一套音乐节的微信推文。": "A set of WeChat posts for a music festival.",
  "城市洞穴": "Here Who Digs",
  "一个对城市中人迹罕至的兴趣点的可能的解决方案。": "A possible solution for rarely visited points of interest in the city.",
  "夹层与拥抱": "Mezzanine and Hug",
  "一本COVID-19主题的小册子设计。": "A brochure design with a COVID-19 theme.",
  "塞壬陷阱": "Siren's Trap",
  "一套用于社团招募的宣传材料。": "A set of promotional materials for club recruitment.",
  "空虚综合征": "Hollowness Syndrome",
  "一部逐帧描绘空洞循环的短动画。": "A short animation that depicts a hollow loop frame by frame.",
  "生活在浙大": "Live in ZJU",
  "一个娱乐游戏项目的UI设计。": "UI design for an entertainment game project.",
  "智能营销系统": "Smart Marketing System",
  "一个加油站营销系统的原型。": "A prototype of a gas station marketing system.",
  "回溯": "Retrospect",
  "重新设计一个提供呼吸机会的城市广场空间。": "Redesigning a city square space that offers breathing opportunities.",
  "远游": "Long Journey",
  "围绕旅行主题的滨水区重建设计。": "Redesign of a waterfront area centered around the theme of travel.",
  "城市榫卯": "Urban Mortise and Tenon",
  "基于形态学的全龄混合社区重新设计。": "Redesign of a mixed-age community based on morphological principles.",
  "清理360": "Clean 360",
  "一个更好、更整洁的360网站的原型。": "A prototype of a better and cleaner 360 website.",
  "留白": "Whitespace",
  "基于生态保护的湖泊周边概念设计。": "Conceptual design around a lake based on ecological protection.",
  "失序&重构": "Disorder & Reconstruction",
  "基于碳中和概念的食堂组团区块生态改造。": "Ecological renovation of cafeteria cluster blocks based on the concept of carbon neutrality.",
  "杰克的冒险": "Jack's Adventure",
  "儿童友好的城市核心区重新设计。": "Redesign of a child-friendly urban core area.",
  "迭代器的评论": "Iterator's Comments",
  "一个简单的网站，显示游戏《雨世界》中的文本，用于叙事研究和参考。": "A simple website that displays texts from the game Rain World for narrative research and reference.",
  "危机合约唱片汇编": "Contingency Contract Record Compilation",
  "为《明日方舟》危机合约活动的专辑设计的一套封面。": "A set of album covers designed for the 'Contingency Contract' event in Arknights.",
  "P&P家装": "P&P Home Decoration",
  "组织纳新的微信推文布局。": "WeChat post layout for organization recruitment.",
  "影迷在宜家": "Movie Fans at IKEA",
  "一套戏仿电影海报的娱乐性图像。": "A set of parody movie posters for entertainment.",
  "泰拉旅游指南": "Terra Travel Guide",
  "一套基于《明日方舟》设定的同人物料。": "A set of fan materials based on the setting of 'Arknights'.",
  "你是同性恋！": "You Are Gay!",
  "一套为国际不再恐惧同性恋、跨性别与双性恋日制作的插画。": "A set of illustrations created for the International Day against Homophobia, Transphobia, and Biphobia.",
  "迷因大师": "Meme Master",
  "一套翻牌游戏的卡片，主题是常见的中国互联网梗图或流行语。": "A set of flashcard game cards themed around common Chinese internet memes or popular phrases.",
  "标识与字体包": "Logo and Font Pack",
  "为各种项目设计的标识和字体。": "Logos and fonts designed for various projects.",
  "2021至今": "2021 to Present",
  "海报与插画包": "Poster and Illustration Pack",
  "为各种项目制作的海报。": "Posters created for various projects.",
  "MOC设计文档": "MOC-Design-DOCS",
  "为MOC清唱团搭建的设计指南（建设中）。": "Design guidelines for the MOC club (under construction).",
  "甜蜜的盛宴，献给饥饿的人": "Sweet Gesaed, Geofferod to Tham Hungrum",
  "效仿炼金术的增强现实（AR）生成式图像。": "Augmented Reality (AR) generative images imitating alchemy.",
  "自我的静观": "Contemplatio Sui",
  "一个有关创作冲动的交互装置。": "An interactive device related to creative impulses.",
  "日期": "Date",
  "完整": "Complete ",
  "合作": "Collaboration ",
  "主修": "Major ",
  "私人": "Private ",
  "长期": "Long-term ",
  "英语": "English",
  "未完成": "Incomplete ",
  "概念策划": "Concept Planning",
  "视觉识别": "Visual Identity",
  "传单设计": "Flyer Design",
  "印刷设计": "Print Design",
  "插图": "Illustration",
  "推文设计": "Tweet Design",
  "网页设计": "Web Design",
  "前端技术": "Front-end Technology",
  "创新设计": "Innovative Design",
  "书籍设计": "Book Design",
  "封面艺术": "Cover Art",
  "叙事": "Narrative",
  "动画": "Animation",
  "音乐": "Music",
  "用户界面": "User Interface",
  "游戏": "Game",
  "卡牌": "Card",
  "服务设计": "Service Design",
  "用户体验": "User Experience",
  "设计文本": "Design Text",
  "景观设计": "Landscape Design",
  "展板": "Display Board",
  "城市设计": "Urban Design",
  "原型": "Prototype",
  "同人作品": "Fan Works",
  "贴纸": "Stickers",
  "可穿戴设备": "Wearable Devices",
  "生成式图像": "Generative Images",
  "字体设计": "Font Design",
  "增强现实": "Augmented Reality",
  "手绘": "Hand-drawn",
  "装置": "Installation",
  "一月": "January",
  "二月": "February",
  "三月": "March",
  "四月": "April",
  "五月": "May",
  "六月": "June",
  "七月": "July",
  "八月": "August",
  "九月": "September",
  "十月": "October",
  "十一月": "November",
  "十二月": "December",
  "视觉传达": "Visual Communication",
  "实体产品": "Physical Products",
  "交互设计": "Interaction Design",
  "数字媒体": "Digital Media",
  "环境设计": "Environmental Design",
  "图形与排印": "Graphics and Typography",
  "建模与渲染": "Modeling and Rendering",
  "综合开发": "Full-stack Development",
  "视频与音频": "Video and Audio",
  "前端": "Front-end",
  "数据处理": "Data Processing",
  "这是一个耗时较长的大型项目。在这个项目中，我负责了完整的概念策划、主视觉设计、衍生设计，独立完成从最初的概念阶段到最终的打印。本次的目标是为了一个阿卡贝拉（纯人声合唱）专场音乐会设计一套完整的宣传和演出概念。": "This is a time-consuming large-scale project. In this project, I was responsible for complete concept planning, main visual design, and derivative design, independently completing everything from the initial concept stage to the final print. The goal was to design a complete set of promotional and performance concepts for an a cappella (pure vocal) concert.",
  "主视觉": "Key Visual",
  "项目的视觉基调：从多样的色彩中提取的概念，以不同歌曲组的情感色彩为出发点。": "Visual tone of the project: a concept extracted from diverse colors, starting from the emotional colors of different song groups.",
  "门票": "Ticket",
  "附带了抽奖券功能": "Includes a raffle ticket feature",
  "工牌": "ID Badge",
  "亚克力制品": "Acrylic Products",
  "易拉宝": "Roll-up Banner",
  "基本上是主视觉的加长版": "Basically an extended version of the main visual",
  "“岩浆瀑布”": "Lava Waterfall",
  "传单系列Ⅰ：用Blender渲染了岩浆流动在方块上的效果，表现一种热情的红色。": "Flyer Series I: Rendered the effect of lava flowing over blocks using Blender, showcasing a passionate red color.",
  "“午夜”": "Midnight",
  "传单系列Ⅱ：尝试了更倾向墨水的液体质感，模拟暗淡的午夜。": "Flyer Series II: Attempted a more ink-like liquid texture to simulate a dim midnight.",
  "“马蒂尼橄榄”": "Martini Olive",
  "传单系列Ⅲ：这一组歌曲充满生活的情调，采用了更古典的方案。": "Flyer Series III: This set of songs is full of lively atmosphere, adopting a more classical approach.",
  "“萨摩亚太阳”": "Samoan Sun",
  "传单系列Ⅳ：更加绚烂和阳光的情绪，颜色来自于非洲国家的太阳。": "Flyer Series IV: A more vibrant and sunny mood, with colors inspired by the sun of African countries.",
  "“焦糖咖啡店”": "Caramel Cafe",
  "传单系列Ⅴ：醇厚而浓郁的组曲，比较符合咖啡的色彩。": "Flyer Series V: A rich and mellow suite, more in line with coffee colors.",
  "“草甸紫罗兰”": "Meadow Violet",
  "传单系列Ⅵ：逆反差字体和更多几何图形，表达这组歌曲的现代性。": "Flyer Series VI: Inverted contrast fonts and more geometric shapes to express the modernity of this set of songs.",
  "节目单": "Program Booklet",
  "捏他了blender的渲染节点，属于设计彩蛋。": "Tweaked Blender's rendering nodes, serving as a design Easter egg.",
  "这个项目从“潮汐”一词的字面意义出发，将其与海洋生物联系起来，从而出现了“展览”的概念。展品被放置在橱窗中，象征着孕育和鱼类的迁徙活动。基于此，为微信公众号推文设计了一个视觉方案，用以展示将在音乐节上演出的乐队。": "This project starts from the literal meaning of the word 'tide' and connects it with marine life, leading to the concept of an 'exhibition'. The exhibits are placed in showcases, symbolizing nurturing and fish migration activities. Based on this, a visual plan was designed for WeChat posts to showcase the bands that will perform at the music festival.",
  "推文的入口图，基本确定了项目风格：基金会、档案、危险管理。": "The entry image of the post essentially defines the project style: foundation, archives, risk management.",
  "布局": "Layout",
  "推文内页。": "Post inner pages.",
  "封面": "Cover",
  "推文封面。": "Post cover.",
  "乐队宣传页 #1": "Band Promotional Page #1",
  "元素基本沿用主视觉，采用了“生态科研”的概念。": "Elements essentially follow the main visual, adopting the concept of 'ecological research'.",
  "乐队宣传页 #2": "Band Promotional Page #2",
  "乐队宣传页 #3": "Band Promotional Page #3",
  "乐队宣传页 #4": "Band Promotional Page #4",
  "乐队宣传页 #5": "Band Promotional Page #5",
  "乐队宣传页 #6": "Band Promotional Page #6",
  "这是在一门课程中为城市中未开发的兴趣点设计的解决方案，涉及用户研究、迭代设计、流程设计、网页设计和前端开发。目标是为这些“城市洞穴”注入新的独特活力，使其与热门旅游景点区别开来。": "This is a solution designed for undeveloped points of interest in the city as part of a course, involving user research, iterative design, process design, web design, and front-end development. The goal is to inject new unique vitality into these 'urban caves', distinguishing them from popular tourist spots.",
  "作品封面。": "Work Cover.",
  "调研部分": "Research Section",
  "在这些洞穴之间旅行的感觉如何？": "What does it feel like to travel between these caves?",
  "流程设计": "Process Design",
  "解决方案的主要构造。": "Main structure of the solution.",
  "网页样机": "Web Prototype",
  "网页界面如何工作。": "How the web interface works.",
  "故事板 #1": "Storyboard #1",
  "跳进兔子洞。": "Jump into the rabbit hole.",
  "故事板 #2": "Storyboard #2",
  "找到通往神秘位置的路。": "Find the way to a mysterious location.",
  "故事板 #3": "Storyboard #3",
  "从管理员那里获得一个全新的立方体。": "Get a brand new cube from the administrator.",
  "项目排版": "Project Typography",
  "在这个项目中，我尝试探讨了新冠疫情以来人们之间的联系。在书籍装帧设计上，我采用三个开本的分册合订的方式，中间采用亚克力板分隔。他们分别讨论了疫情的视觉、疫情的文本、疫情的迷因，试图让读者感受到变化、不安定和戏谑的氛围。": "In this project, I attempted to explore the connections between people since the COVID-19 pandemic. For the book binding design, I used a three-volume binding method with acrylic panels in the middle. They respectively discuss the visuals of the pandemic, the texts of the pandemic, and pandemic memes, trying to let readers feel a sense of change, instability, and satire.",
  "装帧示意图": "Binding Diagram",
  "亚克力板分隔，锁线胶装。": "Acrylic panel separation, thread-lock binding.",
  "封面设计稿": "Cover Design Draft",
  "横线为锁线位置的示意，与亚克力材质合作形成双层视觉效果。": "Horizontal lines indicate the thread-lock positions, creating a double-layer visual effect in collaboration with acrylic material.",
  "内插 #1": "Insertion #1",
  "扁桃体国旗。": "Tonsil Flag.",
  "内插 #2": "Insertion #2",
  "胶囊杂志。": "Capsule Magazine.",
  "内插 #3": "Insertion #3",
  "虚构摄影。": "Fictional Photography.",
  "内插 #4": "Insertion #4",
  "中国电影系列产品。": "Chinese Movie Series Products.",
  "内插 #5": "Insertion #5",
  "不要恐慌。": "Don't Panic.",
  "内插 #6": "Insertion #6",
  "关于距离的故事之一。": "One of the Stories About Distance.",
  "内插 #7": "Insertion #7",
  "关于距离的故事之二。": "Second Story About Distance.",
  "内插 #8": "Insertion #8",
  "书籍设计稿。": "Book Design Draft.",
  "这是一个社团纳新的宣传项目，采用了 Art Deco 风格的视觉艺术，试图还原黄金时代的西班牙大航海、以及传说中海妖塞壬的故事。": "This is a promotional project for club recruitment, using Art Deco visual art style, attempting to recreate the Golden Age of Spanish exploration and the legendary siren myths.",
  "标题设计": "Title Design",
  "选用装饰性字体，配合线条风格的纹样。": "Used decorative fonts, complemented by line-style patterns.",
  "三折页": "Tri-fold Brochure",
  "保留风格一致的情况下做了一些延伸。": "Made some extensions while maintaining consistent style.",
  "基本是深海和航船元素。": "Basically deep-sea and ship elements.",
  "该项目来自于我修读的课程《动画设计》，在该门课程中我们拟构了一名陷入空间循环的人在追逐几分钟前的自己，试图通过这个表现方式构造一个过于无聊的人，因此这部动画被称作“空虚综合征”。本项目为小组合作，在动画制作中，我负责了以下内容：剧本撰写，演出与部分分镜设计，美术监督，部分原画、动画以及上色，剪辑及摄影，音响监督，ED音乐制作，音效设计。": "This project comes from the course 'Animation Design'. In this course, we conceptualized a person trapped in a spatial loop chasing their self from a few minutes ago, trying to construct an overly bored individual through this representation, hence the animation is called 'Void Syndrome'. This project was a group collaboration. In the animation production, I was responsible for the following: scriptwriting, performance and partial storyboard design, art supervision, some key animation, coloring, editing and filming, sound supervision, ED music production, and sound effect design.",
  "在我们开始制作动画之前的原始概念。": "Original concept before we started producing the animation.",
  "视频的封面。": "Video Cover.",
  "草图": "Sketch",
  "相机位置的草图。": "Sketch of camera positions.",
  "完整的动画，也可以从标题上的Bilibili链接访问。": "Complete animation, which can also be accessed via the Bilibili link in the title.",
  "《空虚综合征》ED": "'Void Syndrome' Ending",
  "动画的结尾音乐，由我作曲、编曲、制作、混音和母带处理。": "The ending music of the animation, composed, arranged, produced, mixed, and mastered by me.",
  "这是一个娱乐性的项目，为了参加中国大学生游戏开发大赛（CUSGA）。该项目是一个以浙江大学为背景的类大富翁卡牌游戏，玩家将扮演一位浙江大学学生并试图达成普世意义上的胜利，例如学业成功等。该项目包含了戏谑和讽刺的成分。在项目中我作为美术组的成员担任了UI设计制作，为卡牌和界面做了组件设计。": "This is an entertainment project for participating in the China University Student Game Development Competition (CUSGA). The project is a Monopoly-like card game set against the backdrop of Zhejiang University, where players act as Zhejiang University students trying to achieve universal victories, such as academic success. The project includes elements of parody and satire. In the project, I served as a member of the art team, responsible for UI design and creating components for the cards and interface.",
  "宣传海报": "Promotional Poster",
  "这有点太二次元了。": "This is a bit too anime-like.",
  "Logo #1": "Logo #1",
  "娱乐的标志。": "Entertainment logo.",
  "Logo #2": "Logo #2",
  "健康的标志。": "Health logo.",
  "Logo #3": "Logo #3",
  "学业的标志。": "Academic logo.",
  "Logo #4": "Logo #4",
  "美食街的标志。": "Food Street logo.",
  "Logo #5": "Logo #5",
  "教学楼的标志。": "Teaching Building logo.",
  "Logo #6": "Logo #6",
  "命运的标志。": "Fate logo.",
  "Logo #7": "Logo #7",
  "湖的标志。": "Lake logo.",
  "Logo #8": "Logo #8",
  "宿舍的标志。": "Dormitory logo.",
  "卡片示例 #1": "Card Example #1",
  "跑步打卡。": "Running Check-in.",
  "卡片示例 #2": "Card Example #2",
  "新数据库。": "New Database.",
  "卡片示例 #3": "Card Example #3",
  "此路不通。": "Road Closed.",
  "卡片示例 #4": "Card Example #4",
  "继续熬夜。": "Keep Staying Up Late.",
  "这个项目来自于课程《设计心理学》，在该项目中我们调研并对一个加油站的服务流程进行改进设计。项目包含了设计调研、服务流程优化、线上平台视觉效果优化、营销策略优化。我在全流程均有参与，主要负责品牌视觉效果的优化提升。": "This project comes from the course 'Design Psychology'. In this project, we researched and improved the service process of a gas station. The project includes design research, service process optimization, online platform visual effect optimization, and marketing strategy optimization. I was involved in the entire process, primarily responsible for enhancing the brand's visual effects.",
  "项目的最终展示幻灯片。": "Final presentation slides of the project.",
  "这个项目来源于课程《城市开放空间设计》，在该项目中，我们对西湖一侧的公共广场进行了调研与更新设计。项目基于全年龄段的不同特征设计了一套环线，用以让游客体验一个从青年到老年再回到幼年的循环观景体验，因此称为“回溯”。我参与了项目的全程，并主要负责视觉效果的展现与展板的排版。": "This project originates from the course 'Urban Open Space Design'. In this project, we conducted research and redesigned a public square on the west side of West Lake. The project designed a loop based on the different characteristics of all age groups, allowing visitors to experience a cyclical viewing experience from youth to old age and back to childhood, hence named 'Retrospect'. I participated in the entire project and was mainly responsible for the visual presentation and layout of the display boards.",
  "展板 #1": "Display Board #1",
  "主要关于设计调研。": "Mainly about design research.",
  "展板 #2": "Display Board #2",
  "调研的第2部分，包含一些分析。": "Second part of the research, including some analysis.",
  "展板 #3": "Display Board #3",
  "设计的主要部分。": "Main part of the design.",
  "展板 #4": "Display Board #4",
  "设计的不同区域。": "Different areas of the design.",
  "展板 #5": "Display Board #5",
  "植物部分。": "Plant section.",
  "展板 #6": "Display Board #6",
  "灯光、夜景和总览。": "Lighting, night view, and overview.",
  "这个项目同样来源于《城市开放空间设计》，位于上一个项目的街对面，我们对这一片滨水的空间进行开放设计。概念上沿袭上一个项目，在青年阶段的人们离开舒适圈走向社会开始游历人间，因此取名为“远游”。形式语言上多采用了浮萍、流线、水纹的样式。我参与了项目的全程，并主要负责视觉效果的展现与展板的排版。": "This project also originates from 'Urban Open Space Design'. Located across the street from the previous project, we conducted open design on this waterfront area. Conceptually, it follows the previous project, where people in their youth leave their comfort zones to explore the world, hence named 'Long Journey'. The formal language mainly adopts patterns of duckweed, streamlines, and water ripples. I participated in the entire project and was mainly responsible for the visual presentation and layout of the display boards.",
  "设计调研。": "Design Research.",
  "概念部分。": "Concept Section.",
  "小区块设计。": "Small Block Design.",
  "铺装和概览。": "Paving and Overview.",
  "这个项目来自于课程《城市设计》，在这个项目中，我们对南湖北岸的社区进行了调研与更新设计。项目基于调研中展现的场地历史文脉与建筑特征，利用城市形态学的方法概括出基础的形式语言，并用该样式扩展到整个区块。同时兼顾了对全年龄住民的友好。我参与了项目的全程。": "This project comes from the course 'Urban Design'. In this project, we conducted research and redesigned a community on the north shore of Nanhu Lake. Based on the historical context and architectural features revealed in the research, we used urban morphology methods to summarize the basic formal language and applied this style to the entire block. At the same time, we ensured it was friendly to residents of all ages. I participated in the entire project.",
  "项目的设计文本。": "Design Text of the Project.",
  "这个项目来自于课程《人类工效学》，在推进该项目时我刚刚接触UI和网页端的知识，因此仅仅为360设计了一个更加干净的原型。实际上该项目仅考虑了视觉上的需求，显得比较稚嫩。另外，也大量参考了苹果和谷歌的视觉美学。项目在figma上的部分由本人独立完成。": "This project comes from the course 'Human Factors Engineering'. When advancing this project, I had just started learning UI and web development, so I only designed a cleaner prototype for 360. In reality, the project only considered visual needs and appeared somewhat immature. Additionally, I extensively referenced the visual aesthetics of Apple and Google. Parts of the project on Figma were completed independently by me.",
  "原型 #1": "Prototype #1",
  "主页原型。": "Homepage Prototype.",
  "原型 #2": "Prototype #2",
  "第二主页原型。": "Second Homepage Prototype.",
  "原型 #3": "Prototype #3",
  "适应化页面。": "Adaptive Page.",
  "原型模拟。": "Prototype Simulation.",
  "这个项目来自于课程《城市公共艺术设计》，该项目参加浙江大学的环启真西湖概念设计方案征集竞赛。我们着眼于场地湿地的特征，提取了生态还原与鸟类友好作为主要的概念，因此取名为“留白”。我参与了项目的全程，在建模、渲染、视觉效果、排版方面做出主要贡献。": "This project originates from the course 'Urban Public Art Design' and participated in Zhejiang University's Huan Qizhen West Lake Concept Design Competition. We focused on the characteristics of the site's wetlands, extracting ecological restoration and bird-friendliness as the main concepts, hence named 'Whitespace'. I participated in the entire project, making major contributions in modeling, rendering, visual effects, and layout.",
  "设计调研和概览。": "Design Research and Overview.",
  "植物、分区和构筑物。": "Plants, Zoning, and Structures.",
  "这个项目来自于课程《园林规划设计》。该项目以碳中和为核心理念，提取其原有的碎片化的形式语言，针对浙江大学西区食堂附近地块进行了更完整、更具现代性的改造。该项目由本人独立完成。": "This project comes from the course 'Landscape Planning Design'. The project centers on the concept of carbon neutrality, extracting its original fragmented formal language to conduct a more complete and modern renovation of the land near the West Campus cafeteria of Zhejiang University. This project was completed independently by me.",
  "这个项目来自于课程《园林规划设计》，并参与筱祥杯和园冶杯设计竞赛。该项目以儿童友好型社区作为核心理念，对杭州城市阳台周边社区进行更新设计。项目除了基础的形式改造之外，将景观的后续管理，包括线路总体运营和活动规划等也纳入了设计考察。我全程参与了该项目，并主要负责视觉语言的部分。": "This project comes from the course 'Landscape Planning Design' and participated in the Xiaoxiang Cup and Yuan Ye Cup design competitions. The project centers on the concept of a child-friendly community, redesigning the surrounding communities of Hangzhou Urban Balconies. In addition to basic form renovations, the project also incorporated subsequent landscape management, including overall operation of routes and activity planning. I was involved in the entire project and was mainly responsible for the visual language part.",
  "设计调研与分析。": "Design Research and Analysis.",
  "这个项目是我出于对前端和网页的兴趣编写的第一个网站，其内容为我当时沉迷的游戏《雨世界》中的重要角色“迭代器”们的语录，用以方便我在研究游戏内容时查阅。我在Figma中绘制了一部分原型图，但最终实现到网页上时仍然具有一定的差异性，这对我认知前端与设计对接的相关知识有显著帮助。": "This project is the first website I created out of interest in front-end and web development. Its content consists of quotes from important characters called 'Iterators' in the game 'Rain World', intended to facilitate my research of the game content. I drew some prototype diagrams in Figma, but there were still some differences when implementing them on the web, which significantly helped me understand the integration of front-end and design knowledge.",
  "导航页原型。": "Navigation Page Prototype.",
  "第二导航页原型。": "Second Navigation Page Prototype.",
  "原型 #4": "Prototype #4",
  "内容页原型（最终内容并不如同预期）。": "Content Page Prototype (Final content did not meet expectations).",
  "背景": "Background",
  "我为背景图绘制的图像。": "Images I drew for the background.",
  "这个网站用原生JS+CSS+HTML撰写，后来我开始使用框架，基本就没有再更新了。": "This website was written using native JS+CSS+HTML. Later, I started using frameworks and basically stopped updating it.",
  "这是为我长期玩的一个手机游戏《明日方舟》的一个活动“危机合约”中产出的音乐设计的一套专辑封面，我提取了这些音乐中特征性的文化成分并尝试视觉化它们（当然其上的Logo来自于《明日方舟》官方设计）。": "These are a set of album covers designed for the 'Contingency Contract' event in the mobile game Arknights, which I have been playing for a long time. I extracted the distinctive cultural elements from these music tracks and attempted to visualize them (of course, the logos on them come from Arknights official design).",
  "尘环行动": "Operation Ashring",
  "阿凡达，指环王，沙丘。": "Avatar, The Lord of the Rings, Dune.",
  "利刃行动": "Operation Blade",
  "攻击性，傲慢，杀死比尔。": "Aggression, arrogance, Kill Bill.",
  "燃灰行动": "Operation Cinder",
  "青色怒火，燃烧，扬尘。": "Azure rage, burning, dust up.",
  "寻昼行动": "Operation Dawnseeker",
  "城市夜晚，烛光，现代。": "City nights, candlelight, modern.",
  "渊默行动": "Operation Deepness",
  "克苏鲁，深海恐惧症，洛夫克拉夫特。": "Cthulhu, thalassophobia, Lovecraft.",
  "铅封行动": "Operation Lead Seal",
  "坚硬，装甲，涂装。": "Hardness, armor, paintwork.",
  "松烟行动": "Operation Pine Soot",
  "新中式，纤维，水墨画。": "New Chinese style, fibers, ink painting.",
  "黄铁行动": "Operation Pyrite",
  "化学元素，黑嗓，摇滚。": "Chemical elements, growl, rock.",
  "光谱行动": "Operation Spectrum",
  "赛博朋克，霓虹灯，电子竞技。": "Cyberpunk, neon lights, e-sports.",
  "蛮鳞行动": "Operation Wild Scales",
  "鳄鱼，南非，部落风格。": "Crocodile, South Africa, tribal style.",
  "这是一个为社团招新设计的项目，项目主体是一篇推文，以家装品牌为概念，尝试吸引更多加入者。项目的主体流式布局参考了宜家的视觉风格。": "This is a project designed for club recruitment. The main body of the project is a WeChat post, conceptualized as a home decoration brand, attempting to attract more members. The main flow layout of the project references IKEA's visual style.",
  "布局 #1": "Layout #1",
  "微信推文布局。": "WeChat post layout.",
  "布局 #2": "Layout #2",
  "布局 #3": "Layout #3",
  "布局 #4": "Layout #4",
  "布局 #5": "Layout #5",
  "布局 #6": "Layout #6",
  "布局 #7": "Layout #7",
  "布局 #8": "Layout #8",
  "布局 #9": "Layout #9",
  "布局 #10": "Layout #10",
  "布局 #11": "Layout #11",
  "在一次出游偶遇了一个非常有趣的地方，因此拍了很多照片。回程后我利用将这些照片依据各自匹配的电影做了二次创作，这是一次有趣而快乐的创作经历。": "During a trip, I stumbled upon a very interesting place and took many photos. On the way back, I used these photos to recreate them based on matching movies, which was an interesting and enjoyable creative experience.",
  "《坠楼死亡的剖析》": "'Anatomy on Fall'",
  "很好的电影。": "Good movie.",
  "《涉过愤怒的海》": "'Across the Furious Sea'",
  "褒贬不一。": "Mixed reviews.",
  "《圣山》": "'The Holy Mountain'",
  "宗教与精神世界。": "Religion and the spiritual world.",
  "《双峰》": "'Twin Peaks'",
  "神秘主义。": "Mysticism.",
  "《小时代#4》": "'Tiny Times #4'",
  "豆瓣不敢评价。": "Daoyin (Douban) dares not comment.",
  "关于一幅名画的梗。": "A meme about a famous painting.",
  "解构中……": "Deconstructing...",
  "这是一些游戏《明日方舟》中产出的同人制品，我称它们为“泰拉旅游指南”，因为其概念是你作为一个游客能在游戏的虚构世界观下获得什么。我预计对游戏中的不同地区做一些特色制品，凸显地区风格，同时也尝试模仿这些地区的设计风格作为练习。": "These are fan-made products produced in the game 'Arknights', which I call 'Terra Travel Guides' because their concept is what you, as a tourist, can obtain within the game's fictional worldview. I plan to create some specialized products for different regions in the game to highlight regional styles while also attempting to mimic these regions' design styles as practice.",
  "《孤星》电影海报": "'Lone Trail' Movie Poster",
  "哥伦比亚，灵感来自美国的黄金时代，核心视觉风格为原子朋克。": "Colombia, inspired by America's Golden Age, with a core visual style of atom-punk.",
  "谢拉格旅游宣传册": "Kjerag Travel Brochure",
  "一个以旅游业为核心的地区，试图模仿川藏和中亚高原地区的纺织风格。": "A tourism-centric region, attempting to imitate the textile styles of the Sichuan-Tibet and Central Asian plateau regions.",
  "散落的贴纸": "Scattered Stickers",
  "为不同地区设计了一套贴纸。": "Designed a set of stickers for different regions.",
  "这是一套为国际不再恐同恐双恐跨日绘制的系列插图，使用Adobe Illustrator，尝试用多样的方式解构性少数群体的困境。其中有受到邱妙津《鳄鱼手记》的影响。": "This is a series of illustrations created for International Day against Homophobia, Transphobia, and Biphobia, using Adobe Illustrator. It attempts to deconstruct the dilemmas of sexual minorities in various ways, influenced by Qiu Miaojin's 'Crocodile Notes'.",
  "模拟传单": "Mock Flyer",
  "将在倒悬彩虹博物馆展出。": "Will be exhibited at the Upside-Down Rainbow Museum.",
  "插画 #1": "Illustration #1",
  "一个性别自由的吻。": "A gender-neutral kiss.",
  "插画 #2": "Illustration #2",
  "插画 #3": "Illustration #3",
  "遇见彩虹，吃定彩虹！": "Meet the Rainbow, Catch the Rainbow!",
  "插画 #4": "Illustration #4",
  "第二次拥抱。": "Second Embrace.",
  "插画 #5": "Illustration #5",
  "穿过街道。": "Crossing the Street.",
  "插画 #6": "Illustration #6",
  "冲入黑墙。": "Rushing into the Black Wall.",
  "在这个项目中，我广泛收集了中文互联网中常见的迷因（梗图），并为此创建了一个notion文档（见标题链接）。我为这些迷因设计了一个翻牌游戏，玩家可以通过观看卡牌的正面猜测这个迷因的含义，随后可以翻到背面进行验证，也可以自由地对卡牌进行分组、排序。我希望通过这个游戏更加了解不同圈层、性别等属性的人对不同的梗的看法。": "In this project, I extensively collected common memes (meme images) from the Chinese internet and created a Notion document for them (see title link). I designed a flip card game for these memes, where players can guess the meaning of a meme by viewing the front of the card and then flip it to verify. Players can also freely group and sort the cards. I hope this game helps me better understand how people from different circles, genders, and other attributes perceive various memes.",
  "在游戏式的调研后，我设计了一个可穿戴设备的外观，并结合Touch Designer创建了一个可交互的“口罩”般的设备。穿戴者可以自由地通过键盘和旋钮的输入调整屏幕上显示的文本样式，以及它们被迷因“影响”后的效果。": "After game-style research, I designed the appearance of a wearable device and created an interactive 'mask'-like device using Touch Designer. Wearers can freely adjust the text styles displayed on the screen and the effects after being 'influenced' by memes through keyboard and knob inputs.",
  "项目封面": "Project Cover",
  "模仿了《低俗小说》。": "Imitated 'Pulp Fiction'.",
  "口罩原型设计": "Mask Prototype Design",
  "模仿了颈挂式耳机的外观。": "Imitated the appearance of neckband headphones.",
  "卡片设计套组": "Card Design Set",
  "正面为提示和相关图片，反面为释义。": "Front side for prompts and related images, back side for definitions.",
  "设备连接示意": "Device Connection Diagram",
  "使用电脑外接键盘，配合Arduino连接旋钮与Touch Designer通信。": "Using an external computer keyboard, combined with Arduino to connect knobs and communicate with Touch Designer.",
  "实体测试例": "Physical Test Example",
  "组装完成后进行了运行测试。": "Conducted operational tests after assembly.",
  "应用场景例": "Application Scenario Example",
  "最好在镜面反射下进行“自我观察”。": "Best used for 'self-observation' under mirror reflections.",
  "这是一个小型项目的集合，包含了我做的一切杂项的Logo设计、字体设计、视觉识别系统设计、图标设计。": "This is a collection of small projects, including all my miscellaneous logo designs, font designs, visual identity system designs, and icon designs.",
  "P&P Logo": "P&P Logo",
  "推广策划中心的Logo，设计灵感来自灯泡。": "Logo for the Promotion Planning Center, inspired by light bulbs.",
  "MOC清唱团Logo": "MOC Choir Logo",
  "MOC清唱团的Logo，基于三个字母和一只猫。": "Logo for the MOC Choir, based on three letters and a cat.",
  "P&P 贴纸": "P&P Stickers",
  "商品贴纸上的图标，扩展了原有的视觉方案。": "Icons on product stickers, expanding the original visual scheme.",
  "字体设计 #1": "Font Design #1",
  "为潮汐音乐节宣传视频中的部分文字创建的字体。": "Font created for parts of the text in the Tide Music Festival promotional video.",
  "字体设计 #2": "Font Design #2",
  "为潮汐音乐节宣传推文中的部分文字创建的字体。": "Font created for parts of the text in the Tide Music Festival promotional posts.",
  "公众号标志": "WeChat Official Account Logo",
  "为我自己的公众号设计的Logo原型。": "Logo prototype designed for my own WeChat Official Account.",
  "为一个运动和健身品牌设计的视觉识别系统。": "Visual identity system designed for a sports and fitness brand.",
  "这是一个小型项目的集合，包含了难以归类的一系列海报、传单、宣传图、推文图、卡牌、专辑封面、舞台视觉、刊物、实体周边物料、头像、插图等。": "This is a collection of small projects, including a series of hard-to-classify posters, flyers, promotional images, tweet images, cards, album covers, stage visuals, publications, physical merchandise, avatars, illustrations, etc.",
  "惊喜盒子 #1": "Surprise Box #1",
  "微信文章顶部的动态头图。": "Dynamic header image at the top of WeChat articles.",
  "惊喜盒子 #2": "Surprise Box #2",
  "为阿卡贝拉音乐会中的每首歌设计的一套小卡。": "A set of small cards designed for each song in the a cappella concert.",
  "电影": "Movies",
  "为一篇介绍电影的推文设计的封面。": "Cover designed for a WeChat post introducing a movie.",
  "生日快乐": "Happy Birthday",
  "为社团成员设计的生日贺图，模仿《明日方舟》的宣传艺术风格。": "Birthday greeting images designed for club members, imitating the promotional art style of 'Arknights'.",
  "脑叶切片": "Brain Lobe Slice",
  "尝试表达偏头痛感觉的颜色实验。": "Color experiment attempting to express the feeling of migraines.",
  "回声森林": "Echo Forest",
  "为阿卡贝拉社团纳新设计的主视觉海报。": "Main visual poster designed for the a cappella club recruitment.",
  "同人宇宙": "Fan Universe",
  "为ACGN社团的同人制品展设计的宣传海报。": "Promotional poster designed for the ACGN club's fan product exhibition.",
  "散步到家宴": "Stroll to Home Banquet",
  "为内容导向杂志的编辑部设计的纳新海报。": "Recruitment poster designed for the editorial department of a content-oriented magazine.",
  "黑夜女神": "Goddess of the Night",
  "为网络小说《诡秘之主》制作的同人作品，一张描绘了黑夜女神的塔罗牌。": "A fan work created for the online novel 'Lord of Mysteries', a tarot card depicting the Goddess of the Night.",
  "西西弗高速": "Sisyphus Highway",
  "为阿卡贝拉社团的专辑设计的专辑封面，描绘了全年工作中的遗憾与希望并存的状态。": "Album cover designed for the a cappella club's album, depicting a state of coexistence between regret and hope in a year's work.",
  "毕业证书": "Graduation Certificate",
  "为完成组织内训任务的新人设计的证书。": "Certificate designed for newcomers who have completed organizational training tasks.",
  "德洛莉丝的肺": "Dolores's Lungs",
  "基于游戏《极乐迪斯科》的头像插画，象征着德洛莉丝的肺，她是最著名的无罪者，也是德洛莉丝主义的代表。": "Avatar illustration based on the game 'Disco Elysium', symbolizing Dolores Dei's lungs. She is the most famous innocent and the representative of Dolorianism.",
  "五块卵石的梦": "Dream of Five Pebbles",
  "基于游戏《雨世界》的同人插画，描绘了一位迭代器的梦。": "Fan illustration based on the game 'Rain World', depicting a dream of an Iterator.",
  "为浙江大学国际合作与交流处设计的月刊。": "Monthly publication designed for Zhejiang University's International Cooperation and Exchange Office.",
  "为阿卡贝拉歌曲《Seasons of Love》的现场演出设计的背景视频。": "Background video designed for the live performance of the a cappella song 'Seasons of Love'.",
  "为MOC清唱团搭建的设计指南，相比于其他的项目这个项目更偏向纯粹的前端编程。借此机会我熟悉了GitHub自动化部署，以及从Vue转向React框架。网站的布局和样式参考了开发领域鼎鼎大名的MDN文档。": "Design guidelines built for the MOC Choir. Compared to other projects, this one leans more towards pure front-end programming. This opportunity allowed me to become familiar with GitHub automated deployment and transitioning from Vue to React frameworks. The website's layout and styling reference the renowned MDN documentation in the development field.",
  "MOC-Design-DOCS": "MOC-Design-DOCS",
  "在这个项目的编写过程中我熟悉了不同宽度屏幕的响应式布局，以及Markdown头部在数据存储中的应用。": "During the development of this project, I became familiar with responsive layouts for different screen widths and the use of Markdown headers in data storage.",
  "一个受到《密教模拟器》、《真探（第一季）》，以及《明日方舟》“集成战略：萨卡兹的无终奇语”风格影响而产生的项目。由玩家自行搭配绘制的石板，从而根据程序生成特制化的图像，投影在定制的桌布上。这是一个模拟创造于与解构世界的过程。": "A project influenced by the styles of 'Cultist Simulator', 'True Detective (Season 1)', and 'Arknights' 'Integrated Strategy: Sarkaz's Endless Strange Rhetoric'. Players create stone tablets by arranging and drawing them themselves, which then generate specialized images through a program and project them onto a customized tablecloth. This is a process that simulates creation and deconstruction of the world.",
  "一个在缤纷的色彩中摄入能量的人。": "A person absorbing energy in vibrant colors.",
  "伪卡巴拉生命树": "Pseudo-Kabbalistic Tree of Life",
  "受犹太教中的卡巴拉生命树概念影响，以相似的方式编制元素。": "Influenced by the Kabbalistic Tree of Life concept in Judaism, elements are arranged in a similar manner.",
  "视觉化原型": "Visual Prototype",
  "尝试为每个元素设计了外观倾向。": "Attempted to design visual tendencies for each element.",
  "石板绘制与图形设计": "Stone Tablet Drawing and Graphic Design",
  "使用模型颜料将石板设计绘制其上，考虑过UV打印，但在本地没找到能做这种工艺的商家。": "Used model paints to draw designs on the stone tablets. Considered UV printing but couldn't find a local vendor for this craft.",
  "桌布定制": "Tablecloth Customization",
  "一块冰绒桌布，图样由我设计。": "A piece of flannel tablecloth with a pattern designed by me.",
  "测试场景": "Test Scene",
  "在组装完成后，连接电视进行AR运行测试。": "After assembly, connected to a TV for AR operational testing.",
  "在2016年夏季的ARTFORUM以“艺术与身份”作为主题，探讨了移民、集体意识、女性主义、黑人话题等等——即使是在今天的作品集中依然泛滥且甚嚣尘上的主题。": "At the 2016 summer ARTFORUM, under the theme 'Art and Identity', topics such as immigration, collective consciousness, feminism, and Black issues were explored—even today, these themes still prevail and are rampant in the portfolio.",
  "这里的重点在于，我们看到了艺术和政治的关系，但这通常与自我太远。比如身为一名男性去探讨女权主义、怀孕与月经，比如身为顺性别去谈论性少数，比如身为富裕阶层去谈论贫困、歧视等等——当然并不是说无法去谈论，而是这种探讨往往粗浅、自以为是、标签化的。“I feel that my work is minimized by simple references to identity politics, so I’m hesitant to discuss!”艺术家 K8 Hardy 说了相似的含义。": "The focus here is that we see the relationship between art and politics, but it is often too distant from the self. For example, a man discussing feminism, pregnancy, and menstruation; a cisgender person talking about sexual minorities; or someone from an affluent class discussing poverty and discrimination—of course, it doesn't mean it's impossible to talk about, but such discussions are often shallow, presumptuous, and stereotyped. 'I feel that my work is minimized by simple references to identity politics, so I’m hesitant to discuss!' Artist K8 Hardy expressed a similar sentiment.",
  "具身性的，或者说“第一人称”的艺术叙事应当被给予给多的关注，而非采用奇观化的方式阅读并再现设计师置身事外的观察。因此我希望用某种开放性的方式创建一个观察、体验、与反省的过程，并且这个过程是面向自身的。": "Embodied, or 'first-person' art narratives should be given more attention, rather than adopting a spectacle-driven approach to reading and reproducing the designer's detached observations. Therefore, I hope to create a process of observation, experience, and reflection in an open manner, and this process is self-oriented.",
  "尝试效仿构成主义的特征。": "Attempting to emulate the characteristics of Constructivism.",
  "情绪思考": "Emotional Thinking",
  "刻奇与虚伪在大脑中传递。": "Kitsch and hypocrisy are transmitted in the brain.",
  "装置 #1": "Installation #1",
  "连接各个部分的管道采用玻璃材质。": "The pipes connecting each part are made of glass.",
  "装置 #2": "Installation #2",
  "项目整体由四个立方体组成。": "The entire project consists of four cubes.",
  "装置 #3": "Installation #3",
  "表面有丰富的细节，试图营造一种工业崇拜的氛围。": "The surface has rich details, attempting to create an atmosphere of industrial worship.",
  "装置 #4": "Installation #4",
  "顶部输出三种色彩的液体与油并进行混合。": "At the top, three colored liquids and oil are output and mixed.",
  "装置三视图及剖面": "Installation Three Views and Cross-Section",
  "内部是空洞，用以放置水泵与承载液体。": "The interior is hollow, used to place water pumps and carry liquids.",
  "原型测试 #1": "Prototype Test #1",
  "六个水泵共同通过面包板供电。": "Six water pumps are powered together through a breadboard.",
  "原型测试 #2": "Prototype Test #2",
  "三通管孔径有少许问题，导致了一部分液体回流。": "There were slight issues with the diameter of the three-way pipe, causing some liquid backflow.",
  "豆瓣": "Douban",
  "机核": "GCore",
  "微信公众号": "WeChat Official Account",
  "作品集（旧）": "Portfolio (Outdated)",
  "构建": "Build",
  "渲染": "Render",
  "无障碍": "Accessibility",
  "交互": "Interaction",
  "设计": "Design",
  "协助": "Assist",
  "托管": "Hosting",
  "服务": "Service",
  "项目文档": "Project Documentation",
  "Mx.Cro的洗澡时间。": "Mx.Cro's Bath Time.",
  "尽管其中的一些文章十分有趣，但依然带来了一些批评。如Jerry Saltz有着刻薄的评论：“Bravo — even to the over 425 pages in ads, the jargon-filled gobbley-gook, and the many great pieces.”": "Although some of the articles are very interesting, they still bring some criticism. For example, Jerry Saltz has a harsh comment: 'Bravo — even to the over 425 pages in ads, the jargon-filled gobbley-gook, and the many great pieces.'"
}
